app/controllers/countries_controller.rb

SELECT "countries".* FROM "countries"
---
def index
    @countries = Country.all

SELECT "countries".* FROM "countries" WHERE "countries"."map_id" = 12 LIMIT 1
---
def get_country_data
  map_id = params["map_id"]
  country = Country.find_by_map_id(map_id)